v2206/atmospheric_AloisLuggerPlatz/benchmark/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/meshQualityDict.cfg"

// minTetQuality -1e+30;//1E-12;
// maxBoundarySkewness 4;
// minTwist -1e+30;//0.01;
// maxConcave 80;
// maxInternalSkewness 4; 

// // Advanced

// //- Number of error distribution iterations
// nSmoothScale 4;
// //- Amount to scale back displacement at error points
// errorReduction 0.75;

// relaxed
// {   
//     //- Maximum non-orthogonality allowed. Set to 180 to disable.
//     maxNonOrtho 75; 
// }   



//- Maximum non-orthogonality allowed. Set to 180 to disable.
maxNonOrtho 55;
// maxNonOrtho 65;
// maxNonOrtho 80;

//- Max skewness allowed. Set to <0 to disable.
maxBoundarySkewness 4;
maxInternalSkewness 4;

//- Max concaveness allowed. Is angle (in degrees) below which concavity
//  is allowed. 0 is straight face, <0 would be convex face.
//  Set to 180 to disable.
maxConcave 80;

//- Minimum pyramid volume. Is absolute volume of cell pyramid.
//  Set to a sensible fraction of the smallest cell volume expected.
//  Set to very negative number (e.g. -1E30) to disable.
minVol 1e-13;

//- Minimum quality of the tet formed by the face-centre
//  and variable base point minimum decomposition triangles and
//  the cell centre.  Set to very negative number (e.g. -1E30) to
//  disable.
//     <0 = inside out tet,
//      0 = flat tetparaF
//      1 = regular tet
minTetQuality 1e-30;

//- Minimum face area. Set to <0 to disable.
minArea -1;

//- Minimum face twist. Set to <-1 to disable. dot product of face normal
//  and face centre triangles normal
// minTwist 0.05;
minTwist 0.01;

//- Minimum normalised cell determinant
//  1 = hex, <= 0 = folded or flattened illegal cell
minDeterminant 0.001;

//- minFaceWeight (0 -> 0.5)
minFaceWeight 0.05;

//- minVolRatio (0 -> 1)
minVolRatio 0.01;

// must be >0 for Fluent compatibility
minTriangleTwist -1;


// Advanced

//- Number of error distribution iterations
nSmoothScale 4;
    
//- Amount to scale back displacement at error points
errorReduction 0.75;


// ************************************************************************* //
