v2206/atmospheric_AloisLuggerPlatz/benchmark/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// surfaces_top.obj { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        yes; // no;
//         openEdges               yes; // no;
//     }
// }

// surfaces_ground.obj { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        yes; // no;
//         openEdges               yes; // no;
//     }
// }

// surfaces_east.obj { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        yes; // no;
//         openEdges               yes; // no;
//     }
// }

// surfaces_west.obj { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        yes; // no;
//         openEdges               yes; // no;
//     }
// }

// surfaces_north.obj { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        yes; // no;
//         openEdges               yes; // no;
//     }
// }

// surfaces_south.obj { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        yes; // no;
//         openEdges               yes; // no;
//     }
// }


// buildings.stl { 
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }

//     subsetFeatures
//     {
//         nonManifoldEdges        no;
//         openEdges               no;
//     }
// }

buildings.obj { 
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 150; }

    subsetFeatures
    {
        nonManifoldEdges        no;
        openEdges               no;
    }
}



// ************************************************************************* //
